Repository: dolcecyat/pattern
Catalog: *.lproj/Localizable.strings
Languages: ru

source: Behavioral
ru: Поведенческие

source: Generative
ru: Пораждающие

# adding.defaultTextForNameTextField
source: Enter the pattern name
ru: Введите название паттерна

# adding.addNameLabel
source: Name of pattern
ru: Название Паттерна

# adding.defaultTextForDescriptionTextView
source: Enter the pattern description
ru: Введите описание паттерна

# adding.descriptionLabel
source: Description of pattern
ru: Описание паттерна

# adding.add
source: Add
ru: Добавить

# detail.groupString
source: Group:
ru: Группа:

# detail.selectPhotoString
source: Change photo
ru: Изменить фото

# home.designPattensTitleForNavigationBar
source: Design patterns
ru: Паттерны проектирования

# menu.oopPrinciplesLabel
source: OOP principles
ru: Принципы ООП

# menu.designPatternsLabel
source: Design patterns
ru: Паттерны проектирования

# menu.architecturalPatternsLabel
source: Architectural patterns
ru: Архитектурные паттерны

# menu.SOLIDPrinciplesLabel
source: SOLID principles
ru: Принципы SOLID
